{"error": false, "error_message": "", "data": [{"uniqueid": "32059", "show_id": 1702003478, "showdate": "2024-06-03", "showtime": null, "showtitle": "Drag Night at Les Nuits De Fourviere", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-june-3-2024-the-great-theater-lyon-france.html", "settype": "Set", "setnumber": "1", "position": 1, "tracktime": "11:14", "transition_id": 3, "transition": " ->", "footnote": "Debut", "isjamchart": 0, "jamchart_notes": null, "venue_id": 744, "shownotes": "The band dressed in drag for the 2nd ever drag night, exactly 1 year after the show on 2023-06-03. This show featured the debut of Theia. Theia contained Motor Spirit and Extinction quotes. Extinction contained The Grim Reaper teases. The Grim Reaper contained Get Low (Lil Jon & The East Side Boyz), Work It (Missy Elliot), Torture Chamber, and Body Movin' and Intergalactic (Beastie Boys) quotes. Following The Grim Reaper, Joey wished everyone a happy pride month. Gaia contained a drum solo over a metal vamp from the band. After Gaia, Joey shouted out Amy Taylor of Amyl and the Sniffers for doing his makeup pre-show. Ambrose sung a verse of Witchcraft for Stu due to Stu's pedal breaking. Cellophane contained Magma teases and quotes.\r\n\r\nPoster by <a href=\"https://www.instagram.com/amyjeanart?igsh=MzRlODBiNWFlZA==\" target=\"_blank\" rel=\"noreferrer\">Amy Jean</a>; Edition of 100", "showyear": 2024, "showorder": 1, "opener": "Amyl and the Sniffers", "tour_id": 51, "tourname": "2024 Europe/UK Spring", "soundcheck": "", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "The Great Theater", "city": "Lyon", "state": "", "country": "France", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}, {"uniqueid": "38519", "show_id": 1699402879, "showdate": "2024-08-20", "showtime": null, "showtitle": "", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-august-20-2024-thompsons-point-portland-me-usa.html", "settype": "Set", "setnumber": "1", "position": 1, "tracktime": "11:45", "transition_id": 3, "transition": " ->", "footnote": "Joey on guitar", "isjamchart": 0, "jamchart_notes": null, "venue_id": 713, "shownotes": "This show featured the debut of Rats In The Sky. Mars For the Rich was dedicated to Joey's friend Laura from high school who moved to Portland, Maine. This Thing contained an Incredible (M Beat) quote. I'm Not In Your Mind contained Witchcraft teases. Following Le Risque, Joey said that the song should be in Happy Gilmore 2. Let Me Mend The Past contained an <a href=\"https://www.youtube.com/watch?v=BNj1qgdLN6M\" target=\"_blank\" rel=\"noreferrer\">It Ain't Me, Babe</a> (<a href=\"https://en.wikipedia.org/wiki/Bob_Dylan\" target=\"_blank\" rel=\"noreferrer\">Bob Dylan</a>) quote. Following Let Me Mend The Past, Ambrose quoted I'd Rather Go Blind (Etta James). Before The Dripping Tap, Joey shouted out opener Geese. The song itself, during which Stu was crowdsurfed to the nearby river and back, was dedicated to Bill Cavanagh and contained two Antarctica vocal jams with some of the lyrics changed to \"Portland, Maine\" and to being about Stu swimming in the lake nearby (some of The Dripping Tap lyrics were changed to this as well) and Sea of Trees, Head On/Pill, Witchcraft, and Alter Me teases, a Surfin' Safari (The Beach Boys) quote, as well as Joey teasing Forty Six & 2 (Tool) for a large portion of the song. Venusian 2 and Sea of Trees were on the printed setlist (before Mars For the Rich and The Dripping Tap respectively) but were not played.\r\n\r\nPoster by Jason Galea\r\nStandard Edition - 650\r\nFoil Edition- 250", "showyear": 2024, "showorder": 1, "opener": "Geese, DJ Crenshaw", "tour_id": 52, "tourname": "2024 USA/Canada - Summer", "soundcheck": "...", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "Thompson's Point", "city": "Portland", "state": "ME", "country": "USA", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}, {"uniqueid": "38880", "show_id": 1699402951, "showdate": "2024-08-23", "showtime": null, "showtitle": "Acoustic Show", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-august-23-2024-aretha-franklin-amphitheatre-detroit-mi-usa.html", "settype": "Acoustic Set", "setnumber": "1", "position": 1, "tracktime": "13:35", "transition_id": 1, "transition": ", ", "footnote": "", "isjamchart": 1, "jamchart_notes": "river motor spirit and tsc jams, various quotes", "venue_id": 715, "shownotes": "Before Theia, Ambrose quoted Fried. The song itself contained Motor Spirit quotes, a The River jam with Wah Wah quotes, and Motor Spirit and The Silver Cord jams with lyrics. Joey did Michael Jackson-style vocal improv in the intro to Ambergris, which was introduced as a song about sperm whales and contained a short drum solo. Joey did an impression of Guy Fieri before Rats In The Sky. Cavs teased Rock and Roll (Led Zeppelin) before Sad Pilot. After Rats in the Sky, the band heckled Jason Galea to join on tambourine. Before Flight b741, the band got Cavs to hit the gong on his kit. After Flight b741, the band explained that Geelong, aka G-troit, is the sister city to Detroit, as both had a Ford production factory, which closed and destroyed the town. Joey teased Purple Haze (Jimi Hendrix) and Cavs teased Rock and Roll again. You Can Be Your Silhouette contained an extended intro where the band talked about how their talkback mics work and jazz notes. During the song itself, which contained a The End (The Doors) quote, it was described as a song about being yourself. During the intro to Straws In The Wind, the band joked about Ambrose swimming over to Canada and Ambrose walked up to the lights and sound booth.  Nuclear Fusion featured Vincent, a kid from the audience on the intro. Following the intro, Joey teased Twist (Korn). After Nuclear Fusion, Stu shouted out the stream crew. Honey contained O.N.E teases. Minimum Brain Size was introduced as a song about \"loser hypermasculine people.\"  Prior to Rattlesnake Joey conducted a Q&A session with crowd members and Sam. Prior to Billabong Valley, Cavs ran offstage. During Billabong Valley, Joey said he can do a Limp Bizkit beat cause he doesn’t have an electric guitar and doesn’t want to take it to the [Dave] Matthews Bridge, followed by Ambrose climbing on top of the equipment truck on the side of the venue, leading to the line “I’m on the truck!” Her and I (Slow Jam 2), which was last played 2023-06-18 (50 show gap), contained a Slow Jam 1 intro as well as Iron Lung teases.\r\n\r\nPoster by Jason Galea\r\nStandard Edition - 600\r\nFoil Edition- 200", "showyear": 2024, "showorder": 1, "opener": "Geese", "tour_id": 52, "tourname": "2024 USA/Canada - Summer", "soundcheck": "...", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "Aretha Franklin Amphitheatre", "city": "Detroit", "state": "MI", "country": "USA", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}, {"uniqueid": "41493", "show_id": 1699403114, "showdate": "2024-08-28", "showtime": null, "showtitle": "", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-august-28-2024-browns-island-richmond-va-usa.html", "settype": "Set", "setnumber": "1", "position": 2, "tracktime": "13:48", "transition_id": 1, "transition": ", ", "footnote": "", "isjamchart": 1, "jamchart_notes": "Transitioned out of Extinction, the band drifts from the song’s electronic DNA making way for an electric rendition that prominently features guitar. The song’s bright synths lead to delicate guitar lines before a commanding jam climbs to an overdrive soaked crescendo.", "venue_id": 719, "shownotes": "Theia contained The Silver Cord quotes and Motor Spirit teases. Ambrose referenced \"four fried chickens, and a Coke\" from The Blues Brothers because he was eating chicken and quoted Rock Around the Clock (Bill Haley & His Comets) before Evil Death Roll. The song itself contained Theia quotes. Muddy Water contained the drums from The Bitter Boogie as well as quotes. The Bitter Boogie contained the drums from Muddy Water, quotes of Field of Vision with the lyrics changed to \"Field of Chicken\", altered lyrics to reference chicken, and a Muddy Water outro. Raw Feel was introduced as a song about the feeling of putting your hand into a bag of fried chicken. Cavs teased Rock and Roll and Moby Dick (Led Zeppelin) before Field of Vision, which had its lyrics changed to Field of Chicken. Hell was introduced as a song about planet Earth. Hot Wax was on the printed setlist before Hell, but was skipped. Shook Ones, Part II (Mobb Deep) was referenced by Ambrose before Head On/Pill. Head On/Pill contained The Dripping Tap and Chang'e teases and featured Ambrose on sax.\r\n\r\nPoster by Jason Galea\r\nStandard Edition - 500\r\nFoil Edition - 150", "showyear": 2024, "showorder": 1, "opener": "Geese", "tour_id": 52, "tourname": "2024 USA/Canada - Summer", "soundcheck": "", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "Brown's Island", "city": "Richmond", "state": "VA", "country": "USA", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": null, "isrecommended": 0}, {"uniqueid": "42808", "show_id": 1699403231, "showdate": "2024-09-03", "showtime": null, "showtitle": "", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-september-3-2024-the-armory-minneapolis-mn-usa.html", "settype": "Set", "setnumber": "1", "position": 13, "tracktime": "12:14", "transition_id": 3, "transition": " ->", "footnote": "", "isjamchart": 0, "jamchart_notes": null, "venue_id": 722, "shownotes": "Audience member Joe did the vocal intro to Nuclear Fusion. Cellophane contained I'm In Your Mind, Am I In Heaven?, and Lord of Lightning teases. Mystery Jack was last played 2022-05-31. (138 show gap) Hypertension contained Witchcraft and Hot Water teases. Ambrose did a short breakdance after his verse of Le Risque and said Raygun taught him everything he knows. The Grim Reaper contained Telescope (Ambrose Kenny-Smith & GUM), Torture Chamber, Body Movin' and Intergalactic (Beastie Boys) quotes. Magenta Mountain was attempted but only a jam was played (Titled We're Doin' It Together on the Official Bootleg) because Joey's synth wasn't working. This Thing contained a The Land Before Timeland tease. The intro to Am I In Heaven? (which was not on the printed setlist) contained Lava and The Dripping Tap teases and the song itself contained a This Thing tease and a Hypertension jam with lyrics. \r\n\r\nPoster By Job van Rijen\r\nStandard: 600\r\nGold Foil: 200", "showyear": 2024, "showorder": 1, "opener": "Geese", "tour_id": 52, "tourname": "2024 USA/Canada - Summer", "soundcheck": "...", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "The Armory", "city": "Minneapolis", "state": "MN", "country": "USA", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}, {"uniqueid": "45714", "show_id": 1699403442, "showdate": "2024-09-09", "showtime": null, "showtitle": "Late Show", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-september-9-2024-red-rocks-amphitheatre-morrison-co-usa-2.html", "settype": "Set", "setnumber": "1", "position": 16, "tracktime": "10:45", "transition_id": 2, "transition": " > ", "footnote": "", "isjamchart": 0, "jamchart_notes": null, "venue_id": 447, "shownotes": "Wah Wah contained a The River intro with a Cellophane tease and the song itself contained a The River quote as well as a jam and Am I In Heaven? teases. \r\nBefore Antarctica, which was introduced as a song about Antarctica and \"Cookie's biggest regret thinking polar bears live [there]\", Ambrose quoted the outro of Daily Blues. Ambergris was dedicated to sperm whales. Trapdoor was introduced as a song about \"the dungeon Stu keeps Ambrose trapped in to make music\". Before Black Tooth, Stu asked the crowd if anyone had been to the nine Red Rocks shows the band had done, which led Ambrose to quote Nein and say they should play it. Before People-Vultures, Ambrose quoted Walk The Dinosaur (Was (Not Was)). People-Vultures itself contained Iron Lung quotes. Mr. Beat contained an Iron Lung jam with lyrics. Flight b741 was dedicated to Lucas. Theia contained The Silver Cord quotes. Gilgamesh contained Gila Monster quotes. Set contained Ice V teases. Float Along - Fill Your Lungs contained a Dragon jam. Garden Goblin was on the printed setlist after Set but was not played.\r\n\r\nPoster by Jason Galea\r\nStandard - 1200\r\nGold Foil - 300", "showyear": 2024, "showorder": 2, "opener": "Geese", "tour_id": 52, "tourname": "2024 USA/Canada - Summer", "soundcheck": "", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "Red Rocks Amphitheatre", "city": "Morrison", "state": "CO", "country": "USA", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": null, "isrecommended": 0}, {"uniqueid": "50588", "show_id": 1699403601, "showdate": "2024-11-02", "showtime": null, "showtitle": "Acoustic Show", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-november-2-2024-the-rady-shell-at-jacobs-park-san-diego-ca-usa.html", "settype": "Acoustic Set", "setnumber": "1", "position": 16, "tracktime": "8:10", "transition_id": 1, "transition": ", ", "footnote": "", "isjamchart": 0, "jamchart_notes": null, "venue_id": 729, "shownotes": "Chang'e contained Witchcraft quotes from the extended mix. Sense contained Witchcraft teases. Following Raw Feel, Cavs teased <a href=\"https://www.youtube.com/watch?v=VXuyprcBTpk\" target=\"_blank\" rel=\"noreferrer\">Hey Pachuco</a> (<a href=\"https://en.wikipedia.org/wiki/Royal_Crown_Revue\" target=\"_blank\" rel=\"noreferrer\">Royal Crown Revue</a>) from The Mask. Ambrose teased Flight b741 before Dirt. Following Dirt, Ambrose called Joey \"<a href=\"https://en.wikipedia.org/wiki/Joe_Dirt\" target=\"_blank\" rel=\"noreferrer\">Joe Dirt</a>\". Following Flight b741, Joey asked the crowd if anyone in the band had been to their 2022 show in San Diego (2022-04-11) and Stu asked if anyone had been to The Soda Bar (2016-05-18 and 2015-08-25), mentioning there was someone dressed in a panda suit there, who he then spotted in the crowd. Iron Lung contained Can't Stop (Red Hot Chili Peppers) and Witchcraft teases. Muddy Water contained The Bitter Boogie and The Castle In The Air teases. The Bitter Boogie contained the drums from Muddy Water as well as teases. After The Bitter Boogie, Joey teased <a href=\"https://www.youtube.com/watch?v=CnQ8N1KacJc\" target=\"_blank\" rel=\"noreferrer\">Good Riddance</a> (<a href=\"https://en.wikipedia.org/wiki/Green_Day\" target=\"_blank\" rel=\"noreferrer\">Green Day</a>) and <a href=\"https://www.youtube.com/watch?v=3cqU1pFRqYE\" target=\"_blank\" rel=\"noreferrer\">Every Morning</a> (<a href=\"https://en.wikipedia.org/wiki/Sugar_Ray\" target=\"_blank\" rel=\"noreferrer\">Sugar Ray</a>) and asked Sammy to turn his mic through the PA, and Joey teased Every Morning and Good Riddance again. Ambrose then jokingly brought up Green Day’s infamous <a href=\"https://www.youtube.com/watch?v=g9zogQOmQVM\" target=\"_blank\" rel=\"noreferrer\">2012 iHeartRadio incident</a> (during which the band destroyed their instruments angrily after being told their set was being cut short) and multiple band members quoted Billie Joe Armstrong’s exclamations from the performance. God Is Calling Me Back Home had lyrics changed to \"She's calling me back home\" and featured Joey playing guitar with a beer bottle. Inbetween God Is Calling Me Back Home and Magma, Joey teased <a href=\"https://www.youtube.com/watch?v=sSWxU-mirqg\" target=\"_blank\" rel=\"noreferrer\">Tell Me Why</a> (<a href=\"https://en.wikipedia.org/wiki/Neil_Young\" target=\"_blank\" rel=\"noreferrer\">Neil Young</a>). Magma was played for Sammy, featured an extended intro where the band shouted out their crew members, did not have the \"rumble\" verse, and contained a The Silver Cord jam with lyrics. After Magma, the band jokingly played a portion of Gaia acoustically. Theia contained Motor Spirit teases & quotes and The River teases. Only Part I of The River (which was introduced as a song about \"when you wake up in the morning, and you smell something, in the kitchen, it’s not supposed to be there, and it smells real good, and you go eat it, and then you feel real good, then you feel real sick\") was performed and it contained Motor Spirit teases, Theia teases, and a The Silver Cord vocal jam with Theia quotes. Honey and Pleura were on some of the written setlists following Horology but were replaced with Magma. ", "showyear": 2024, "showorder": 1, "opener": "King Stingray, DJ Crenshaw", "tour_id": 58, "tourname": "2024 USA Tour - Fall", "soundcheck": "...", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "The Rady Shell at Jacobs Park", "city": "San Diego", "state": "CA", "country": "USA", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}, {"uniqueid": "51195", "show_id": 1727198613, "showdate": "2024-11-06", "showtime": null, "showtitle": "Experimental Rave Show", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-november-6-2024-the-regency-ballroom-san-francisco-ca-usa.html", "settype": "Rave Set", "setnumber": "1", "position": 1, "tracktime": "17:08", "transition_id": 3, "transition": " ->", "footnote": "", "isjamchart": 1, "jamchart_notes": "Fantastic composed section that flows into a \"Theia\" vocal sample jam, followed by a synth pattern that almost feels like percussion layered over Cavs' drumming into the \"Motor Spirit\" callback, leading into another percussive synth section with robotic bleep-like noises, crashing into a high-energy finale before calming down -> The Silver Cord.", "venue_id": 794, "shownotes": "This show featured a performance of The Silver Cord in full. Theia contained Motor Spirit quotes from the extended mix. Set contained Pump Up the Jam (Technotronic) quotes and the Converge quotes from the extended mix. Chang'e contained the Witchcraft quotes from the extended mix. Gilgamesh contained the Gila Monster quotes from the extended mix. Swan Song contained In Da Club (50 Cent) quotes, the Dragon quotes from the extended mix and a quote of That's the Way (I Like It) (KC and the Sunshine Band). Extinction contained an Incredible (M Beat) quote, a Shanghai tease, and the Flamethrower quotes from the extended mix. Shanghai was also teased directly following the end of Extinction. Intrasport contained a Gonna Make You Sweat (Everybody Dance Now) (C+C Music Factory) quote. Shanghai and The Grim Reaper were on the setlist, before and after Intrasport respectively, but were not played.", "showyear": 2024, "showorder": 1, "opener": "Bullant (Closer)", "tour_id": 58, "tourname": "2024 USA Tour - Fall", "soundcheck": "", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "The Regency Ballroom", "city": "San Francisco", "state": "CA", "country": "USA", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}, {"uniqueid": "52062", "show_id": 1699403890, "showdate": "2024-11-10", "showtime": null, "showtitle": "", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-november-10-2024-revel-entertainment-center-albuquerque-nm-usa.html", "settype": "Set", "setnumber": "1", "position": 14, "tracktime": "11:29", "transition_id": 3, "transition": " ->", "footnote": "", "isjamchart": 0, "jamchart_notes": null, "venue_id": 734, "shownotes": "Mirage City was introduced as a \"country song,\" featured Stu on acoustic guitar and contained a jam with lyrics of <a href=\"https://youtu.be/79y82tDdb_Q?si=pXyxa8TdJ-C3FtiI\" target=\"_blank\" rel=\"noreferrer\">I’ll Be Gone</a> (<a href=\"https://en.wikipedia.org/wiki/Spectrum_(band)\" target=\"_blank\" rel=\"noreferrer\">Spectrum</a>) and a Riff Raff (AC/DC) tease. Raw Feel also featured Stu on acoustic guitar. Ice V contained Hog Calling Contest teases. Ambrose quoted the \"one million dollars\" line from Austin Powers and \"Scotty Doesn't Know\" from EuroTrip in the intro to Magma. The Dripping Tap was introduced as being sponsored by Pepto Bismol and contained You Can Be Your Silhouette and Machine Gun (Jimi Hendrix) teases. Work This Time was on the written setlist after Raw Feel but was not played.", "showyear": 2024, "showorder": 1, "opener": "King Stingray", "tour_id": 58, "tourname": "2024 USA Tour - Fall", "soundcheck": "", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "Revel Entertainment Center", "city": "Albuquerque", "state": "NM", "country": "USA", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}, {"uniqueid": "53539", "show_id": 1699404024, "showdate": "2024-11-16", "showtime": null, "showtitle": "", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-november-16-2024-white-oak-music-hall-houston-tx-usa.html", "settype": "Set", "setnumber": "1", "position": 11, "tracktime": "16:05", "transition_id": 3, "transition": " ->", "footnote": "", "isjamchart": 0, "jamchart_notes": null, "venue_id": 736, "shownotes": "Mr. Beat contained People-Vultures and Magma teases.  Dirt and Mirage City featured Joey on acoustic guitar.  Mirage City had an alternate slower outro section.  Amby quoted Tomorrow (Silverchair) prior to The Dripping Tap, which contained Theia teases and quotes.  Let Me Mend The Past contained an <a href=\"https://www.youtube.com/watch?v=BNj1qgdLN6M\" target=\"_blank\" rel=\"noreferrer\">It Ain't Me, Babe</a> (<a href=\"https://en.wikipedia.org/wiki/Bob_Dylan\" target=\"_blank\" rel=\"noreferrer\">Bob Dylan</a>) quote. Gaia featured a drum solo by Cavs.", "showyear": 2024, "showorder": 1, "opener": "King Stingray", "tour_id": 58, "tourname": "2024 USA Tour - Fall", "soundcheck": "Magma, Flamethrower, Dirt", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "White Oak Music Hall", "city": "Houston", "state": "TX", "country": "USA", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": null, "isrecommended": 0}, {"uniqueid": "62963", "show_id": 1718035821, "showdate": "2025-05-24", "showtime": null, "showtitle": "", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-may-24-2025-plaza-mayor-de-el-poble-espanyol-barcelona-spain.html", "settype": "Set", "setnumber": "1", "position": 3, "tracktime": "9:05", "transition_id": 3, "transition": " ->", "footnote": "First time played in rock arrangement", "isjamchart": 0, "jamchart_notes": null, "venue_id": 658, "shownotes": "The band walkout music was H.O.O.D by Kneecap. Theia was performed in an alternate rock version for the first time and contained a The Land Before Timeland tease and Wah Wah teases. Wah Wah contained a The River intro, quote, and teases as well as a Crumbling Castle tease and Motor Spirit teases and quotes. Open Water featured a drum solo by Cavs. Oddlife, which was played for the first time since 2023-03-13 (114 show gap), was played for Cookie and introduced as his favorite Gizzard song. I'm Not In Your Mind contained a Theia (Extended) jam with lyrics and Cellophane teases and featured Ambrose on sax. After Gila Monster, Joey said Free Palestine.", "showyear": 2025, "showorder": 1, "opener": "Etran de L'Aïr", "tour_id": 57, "tourname": "2025 Europe Residency Tour", "soundcheck": "...", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "Plaza Mayor de El Poble Espanyol", "city": "Barcelona", "state": "", "country": "Spain", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": null, "isrecommended": 0}, {"uniqueid": "64942", "show_id": 1718036030, "showdate": "2025-05-30", "showtime": null, "showtitle": "", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-may-30-2025-lukisks-prison-20-vilnius-lithuania.html", "settype": "Set", "setnumber": "1", "position": 8, "tracktime": "11:48", "transition_id": 3, "transition": " ->", "footnote": "", "isjamchart": 0, "jamchart_notes": null, "venue_id": 784, "shownotes": "This show featured the debuts of Jailbreak (AC/DC) and the synth outro of Flamethrower. Ambrose sung along to the walkout music, which was Party All the Time (Eddie Murphy). Antarctica contained Hot Water and Forty Six and 2 (Tool) teases. Before Hypertension, the band talked about Stu's new guitar, mentioning Jimi Hendrix and Dimebag Darrell, and joking that they wanted to play Little Wing on the table, but Cavs said no because he wanted to play Foxy Lady and Cookie wanted to play She's So Fine. Boogieman Sam was teased before Ice V, which contained Blindness (The Fall) teases. Ambrose quoted “Good day, good evening, and good night!” from The Truman Show before Rats In The Sky. Jailbreak was impromptu/not on the written setlist, unfinished, and contained a Rats In the Sky outro. The Fourth Colour was on the printed setlist after Crumbling Castle but was not played.", "showyear": 2025, "showorder": 1, "opener": "King Stingray", "tour_id": 57, "tourname": "2025 Europe Residency Tour", "soundcheck": "Motor Spirit, Crumbling Castle > The Fourth Colour", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "Lukiškės Prison 2.0", "city": "Vilnius", "state": "", "country": "Lithuania", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}, {"uniqueid": "65933", "show_id": 1718036131, "showdate": "2025-06-06", "showtime": null, "showtitle": "", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-june-6-2025-lycabettus-theatre-athens-greece.html", "settype": "Set", "setnumber": "1", "position": 8, "tracktime": "13:51", "transition_id": 1, "transition": ", ", "footnote": "Rock arrangement", "isjamchart": 1, "jamchart_notes": "Another rock version of the song, but this time featuring  a The Land Before Timeland jam and Iron Lung teases and quotes.", "venue_id": 785, "shownotes": "This show featured the debut of Superposition. The Fourth Colour contained a Dripping Tap jam with lyrics. Band manager Michelle's son Laurence joined the band on stage for Straws in the Wind, which contained Phantom Island quotes and Ambrose chanting \"free free Palestine\". The audience continued the Palestine chants after the song, with the band repeating the slogan once along with them and then again during Minimum Brain Size. Before Nuclear Fusion, Joey thanked King Stingray and DJ Crenshaw. A fan named Tom provided the vocal intro on Nuclear Fusion wearing a Bullant shirt. The rock version of Theia was performed, which contained a Land Before Timeland jam and Iron Lung teases & quotes. Before Ice V, which was dedicated to \"the incredible country called Greece\", Joey told the story of his appearance in the Ice V music video, which was filmed on the island of Idra. The song itself contained Ain't It Funky Now (James Brown) teases. Digital Black was preceded by a tease of A New World. Float Along – Fill Your Lungs contained a Motor Spirit jam with lyrics, a Han-Tyumi, The Confused Cyborg tease, Theia teases and quotes, and a Muddy Water and Superposition tease. Welcome to an Altered Future was on the printed setlist before Digital Black but was not played.", "showyear": 2025, "showorder": 1, "opener": "King Stingray, DJ Crenshaw", "tour_id": 57, "tourname": "2025 Europe Residency Tour", "soundcheck": "", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "Lycabettus Theatre", "city": "Athens", "state": "", "country": "Greece", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}, {"uniqueid": "69296", "show_id": 1730215237, "showdate": "2025-08-06", "showtime": null, "showtitle": "Orchestra Show", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-august-6-2025-the-pavilion-at-ravinia-highland-park-il-usa.html", "settype": "Orchestra Set", "setnumber": "1", "position": 12, "tracktime": "19:06", "transition_id": 1, "transition": ", ", "footnote": "Rock arrangement", "isjamchart": 1, "jamchart_notes": "After the Chicago Philharmonic left the stage following Grow Wings and Fly (which itself contained a Theia jam), the band meandered into a rock-arrangement Theia. Eventually it launches into some up tempo teases and jamming before settling back into a tasty groove before starting up a Field of Vision jam with some ZZ Top teasing.", "venue_id": 799, "shownotes": "This show was played with The Chicago Philharmonic conducted by Sarah Hicks. Panpsych's lyrics were changed to \"Panpsych, fuck yeah\". Silent Spirit contained a false start. Grow Wings and Fly contained additional lyrics about the band pissing themselves and a Theia jam with an Am I In Heaven? tease. Theia was performed in it's rock arrangement and contained Vomit Coffin and The Land Before Timeland teases, a Field of Vision jam, Sharp Dressed Man (ZZ Top) teases and quotes, and band introductions. Only parts I, II, and IV of The River were played. Following Crumbling Castle, Joey asked how the lawn was doing and said he couldn't see them (due to the venue layout making it hard to see the stage from the lawn). Stu then said he’d be in the lawn if he was watching. Mars For The Rich had lyrics changed to \"Fuck Elon Musk\" and \"Tesla's too dear\". Before Iron Lung, Ambrose thanked Chicago for hot dogs and the Blues Brothers, and Stu and Joey said Free Palestine.\r\n", "showyear": 2025, "showorder": 1, "opener": "DJ Crenshaw", "tour_id": 59, "tourname": "2025 Phantom Island - USA", "soundcheck": "", "isverified": 0, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "The Pavilion at Ravinia", "city": "Highland Park", "state": "IL", "country": "USA", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}, {"uniqueid": "70684", "show_id": 1730215438, "showdate": "2025-08-17", "showtime": null, "showtitle": "Field of Vision", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-august-17-2025-meadow-creek-buena-vista-co-usa.html", "settype": "Marathon Set", "setnumber": "1", "position": 1, "tracktime": "9:31", "transition_id": 1, "transition": ", ", "footnote": "Acoustic", "isjamchart": 0, "jamchart_notes": null, "venue_id": 800, "shownotes": "The band dressed in drag for the third annual drag night. Theia, Sad Pilot, Most Of What I Like, and Aerodynamic were performed acoustic. Theia contained The River and The Land Before Timeland teases. Most Of What I Like contained Praise You (Fatboy Slim) teases and was dedicated by Joey to his wife Edith. Aerodynamic was played for the first time without an orchestra. Before Venusian 1, the band said if they should have soundchecked it and joked that if they messed it up, they would play Stoned Mullet instead. Following Venusian 1, Joey quoted Chop Suey (System of a Down) and Lucas shouted out festival act Yvie Oddly. Her and I (Slow Jam 2) contained You Can Be Your Silhouette, Am I In Heaven?, The River, Blindness (The Fall), Crumbling Castle, and Monkey Disco (Babe Rainbow) teases. Following Her and I, the band announced that the festival would be played again next year, and shouted out their manager Michelle Cable and the fans at the festival. O.N.E. was introduced as Duran Duran's favorite song. Before Billabong Valley, Joey mentioned Australian rapper RAED. During The Silver Cord, Stu vamped on the lyrics \"let's get fucked up\" and \"everybody wants to save us.\" Following Daily Blues, Ambrose quoted Scarface (Push It to the Limit) (Paul Engemann). Float Along - Fill Your Lungs was dedicated to Matt Gawiak, a fan that passed away during the show night 1 of the festival and contained a Dragon jam. Ambrose led the crowd in a chant of 'Matt' following Float Along - Fill Your Lungs. The Dripping Tap was also dedicated to Matt Gawaik. Rats In The sky was on the printed setlist after The Garden Goblin but was skipped.", "showyear": 2025, "showorder": 1, "opener": "", "tour_id": 59, "tourname": "2025 Phantom Island - USA", "soundcheck": "", "isverified": 0, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "Meadow Creek", "city": "Buena Vista", "state": "CO", "country": "USA", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}, {"uniqueid": "72818", "show_id": 1743507029, "showdate": "2025-10-31", "showtime": null, "showtitle": "Rave Show", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-october-31-2025-aviva-studios-manchester-england-united-kingdom.html", "settype": "Rave Set", "setnumber": "1", "position": 1, "tracktime": "20:56", "transition_id": 2, "transition": " > ", "footnote": "", "isjamchart": 0, "jamchart_notes": null, "venue_id": 814, "shownotes": "This show featured the debut of Hell's Itch, which was also the synth version and contained Joey's and Stu's final verses only, and \"LUSEQ\". Theia contained a Hot Water tease from Stu on electric flute. Hot Water contained The Dripping Tap teases. Slow Jam 1 contained a Hell's Itch jam. Hell's Itch contained a substantial lyrical portion of Pure Shores (All Saints) before reprising the \"finally red\" chorus. Murder of the Universe was performed in an electronic version for the first time.", "showyear": 2025, "showorder": 1, "opener": "Kit Sebastian (DJ)", "tour_id": 64, "tourname": "2025 Europe Fall", "soundcheck": "", "isverified": 0, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "Aviva Studios", "city": "Manchester", "state": "England", "country": "United Kingdom", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": null, "isrecommended": 0}, {"uniqueid": "74311", "show_id": 1743507701, "showdate": "2025-11-11", "showtime": null, "showtitle": "Rave Show", "artist": "King Gizzard & the Lizard Wizard", "song_id": 387, "songname": "Theia", "artist_id": 1, "permalink": "king-gizzard-the-lizard-wizard-november-11-2025-sasazu-prague-czech-republic.html", "settype": "Rave Set", "setnumber": "1", "position": 2, "tracktime": "30:03", "transition_id": 3, "transition": " ->", "footnote": "", "isjamchart": 0, "jamchart_notes": null, "venue_id": 815, "shownotes": "Theia contained a Gilgamesh quote and The Silver Cord lyrics from Theia's extended mix. Shanghai contained a Grow Wings and Fly jam with lyrics. The Grim Reaper featured Ambrose performing the first two verses in the mosh pit, had a lyric changed to \"the Grim Reaper cashes the Czech Republic\" and contained Sabotage (Beastie Boys) (with lyrics changed to \"listen all of Prague it's a sabotage\"), Intergalatic (Beastie Boys), Bonkers (Dizzee Rascal), Torture Chamber, and Rollin' (Air Raid Vehicle) (Limp Bizkit) quotes. Ice V contained Superposition and Blindness (The Fall) teases. Candles contained a Superposition tease. Sense and Flamethrower (Outro) were swapped on the printed setlist.", "showyear": 2025, "showorder": 1, "opener": "Maddie Ashman", "tour_id": 64, "tourname": "2025 Europe Fall", "soundcheck": "...", "isverified": 1, "slug": "theia", "isoriginal": 1, "original_artist": "", "venuename": "SaSaZu", "city": "Prague", "state": "", "country": "Czech Republic", "timezone": null, "isreprise": 0, "isjam": 0, "css_class": "", "isrecommended": 0}]}